app/views/ende_soap/03_Credit_Vend.soap

SOAP REQUEST

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.nrs.eskom.co.za/xmlvend/revenue/2.1/schema" xmlns:sch1="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema" xmlns:sch2="http://www.nrs.eskom.co.za/xmlvend/meter/2.1/schema">
 <soapenv:Header/>
 <soapenv:Body>
  <sch:creditVendReq xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <clientID xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema" xsi:type="EANDeviceID" ean="PAGASO"/>
   <terminalID xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema" xsi:type="EANDeviceID" ean="0000000000003"/>
   <msgID xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema" dateTime="20210121101931" uniqueNumber="0251"/>
   <authCred xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">
    <opName>PAGASO</opName>
    <password>P@GA$0</password>
   </authCred>
                        
   <idMethod xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">
    <meterIdentifier xsi:type="MeterNumber" msno="04040404040"/>
   </idMethod>
   <purchaseValue xmlns="http://www.nrs.eskom.co.za/xmlvend/revenue/2.1/schema" xsi:type="PurchaseValueCurrency">
    <amt value="100" symbol="AOA"/>
   </purchaseValue>
  </sch:creditVendReq>
 </soapenv:Body>
</soapenv:Envelope>

SOAP RESPONSE

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <creditVendResp xmlns="http://www.nrs.eskom.co.za/xmlvend/revenue/2.1/schema">
         <clientID xsi:type="EANDeviceID" ean="PAGASO" xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <serverID xsi:type="GenericDeviceID" id="1" xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <terminalID xsi:type="EANDeviceID" ean="0000000000003" xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <reqMsgID dateTime="20210121101931" uniqueNumber="0251" xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <respDateTime xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">2021-12-17T18:37:52.6157199+00:00</respDateTime>
         <dispHeader xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">Credit Purchase</dispHeader>
         <operatorMsg xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">Credit Purchase Successful</operatorMsg>
         <custMsg xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">Credit Purchase</custMsg>
         <utility name="ENDE" address="Angola" taxRef="0" xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <clientStatus xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">
            <availCredit value="99997950" symbol="AOA"/>
            <batchStatus banking="open" sales="open" shift="open"/>
         </clientStatus>
         <vendor xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <custVendDetail name="John     Smith" address="Physical, KZN, Durban, Overport, Brickfield" contactNo="Cell:0812345678" accNo="ACC001" locRef="ERF001" utilityType="Electricity" daysLastPurchase="0" xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema"/>
         <creditVendReceipt receiptNo="43">
            <transactions>
               <tx xsi:type="CreditVendTx" receiptNo="43">
                  <amt value="87.72" symbol="AOA"/>
                  <creditTokenIssue xsi:type="q1:SaleCredTokenIssue" xmlns:q1="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">
                     <q1:desc>Credit Token</q1:desc>
                     <q1:meterDetail krn="1" ti="1" sgc="901047" unitOfMeasurement="kWh" msno="04040404040">
                        <q1:meterType tt="02"/>
                     </q1:meterDetail>
                     <q1:token xsi:type="q1:STS1Token">
                        <q1:stsCipher>04040404040000000217</q1:stsCipher>
                     </q1:token>
                     <q1:units value="21.7" siUnit="kWh"/>
                     <q1:resource xsi:type="q1:Electricity"/>
                  </creditTokenIssue>
                  <tariff>
                     <name xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">BT DOMÉSTICA SOCIAL -I (BT DSI)</name>
                     <desc xmlns="http://www.nrs.eskom.co.za/xmlvend/base/2.1/schema">BT DOMÉSTICA SOCIAL -I (BT DSI)</desc>
                  </tariff>
                  <tariffBreakdown xsi:type="q2:StepTariffBreakdown" xmlns:q2="http://www.conlog.co.za/xmlvend/base-ext/2.1.1/schema">
                     <q2:steps>
                        <q2:Step>
                           <q2:units value="12.9" siUnit="kWh"/>
                           <q2:rate value="2.46000" symbol="AOA"/>
                        </q2:Step>
                        <q2:Step>
                           <q2:units value="8.8" siUnit="kWh"/>
                           <q2:rate value="6.41000" symbol="AOA"/>
                        </q2:Step>
                        <q2:Step>
                           <q2:units value="0" siUnit="kWh"/>
                           <q2:rate value="10.89000" symbol="AOA"/>
                        </q2:Step>
                     </q2:steps>
                  </tariffBreakdown>
               </tx>
               <tx xsi:type="ServiceChrgTx">
                  <amt value="12.28" symbol="AOA"/>
                  <accDesc>VAT</accDesc>
               </tx>
               <tenderAmt value="100" symbol="AOA"/>
               <change value="0" symbol="AOA"/>
            </transactions>
            <MonthlyTotals xsi:nil="true"/>
         </creditVendReceipt>
      </creditVendResp>
   </soap:Body>
</soap:Envelope>